app/controllers/game_controller.rb

  def play
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def list
    @games = Game.find :all, :order => 'id DESC', :limit => 100
---
SELECT * FROM `games` ORDER BY id DESC LIMIT 100

  def update
    tasks = Task.find(:all,:conditions => {:game_id => params[:id], :state => 'complete'})
    tasks.each do |task|
      task.state = 'fetched'
      task.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`game_id` = '1' AND `tasks`.`state` = 'complete')
UPDATE `tasks` SET `updated_at` = '2009-10-24 15:33:36', `state` = 'fetched' WHERE `id` = 23