app/controllers/task_controller.rb

    task = Task.new({
      :name => params[:name],
      :specs => params[:specs],
      :game_id => params[:game_id]
    })
    task.save
---
INSERT INTO `tasks` (`name`, `route`, `created_at`, `specs`, `updated_at`, `game_id`, `worker`, `state`) VALUES('harvest', '', '2009-10-24 15:33:19', 'C2:G3', '2009-10-24 15:33:19', 1, 'anonymous', 'incomplete')

  def list
    @game = Game.find(params[:id])
    @tiles = @game.tiles
    @tasks = Task.find(:all, :conditions => {:state => 'incomplete', :game_id => params[:id]})
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)
SELECT * FROM `tasks` WHERE (`tasks`.`game_id` = '4' AND `tasks`.`state` = 'incomplete') ORDER BY id DESC

  def view
    @task = Task.find(params[:id])
    @game = Game.find(@task.game_id)
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 39)
SELECT * FROM `games` WHERE (`games`.`id` = 39)

    task = Task.find_by_id(params[:id])
    task.route = params[:route]
    task.state = 'complete'
    task.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = '33') LIMIT 1
UPDATE `tasks` SET `updated_at` = '2009-10-24 16:19:33', `route` = 'C2,C3,C4', `state` = 'complete' WHERE `id` = 33