app/controllers/task_controller.rb

  def list
    @tasks = Task.find :all
---
SELECT * FROM `tasks`